app/views/translators/index.html.erb

                <div class="well">
                <div><% translator.projects.each do |project|%>
---
SELECT  "projects".* FROM "projects" WHERE "projects"."translator_id" = ?  ORDER BY "projects"."id" DESC LIMIT 1  [["translator_id", 1]]