app/views/clients/index.html.erb

                  <div class="modal-body">
                    <div><% client.projects.each do |project|%>
---
SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 1]]