app/controllers/clients_controller.rb

INSERT INTO "clients" ("name", "email", "address", "rut", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test "], ["email", "test@test.com"], ["address", ""], ["rut", "14165647-3"], ["created_at", "2016-03-30 14:09:27.731621"], ["updated_at", "2016-03-30 14:09:27.731621"]]
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 3]]
---
  def destroy
    @client.destroy