app/controllers/projects_controller.rb

INSERT INTO "projects" ("client_id", "name", "words", "rate", "extras", "sent", "translator_id", "customer_payment", "translator_payment", "date_received", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "customer_payment" = ?, "translator_payment" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["customer_payment", "t"], ["translator_payment", "f"], ["updated_at", "2016-04-07 20:37:55.649694"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)

SELECT "clients".* FROM "clients"
---
    def set_clients
      @clients = Client.all

SELECT "translators".* FROM "translators"
---
    def set_translators
      @translators = Translator.all