app/controllers/translators_controller.rb

SELECT "translators".* FROM "translators"
---
  def index
    @translators = Translator.all

INSERT INTO "translators" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Alex"], ["email", "alexander.holmes@gmail.com"], ["created_at", "2016-03-30 16:55:23.587882"], ["updated_at", "2016-03-30 16:55:23.587882"]]
---
  def create
    @translator = Translator.new(translator_params)

    respond_to do |format|
      if @translator.save

SELECT  "translators".* FROM "translators" WHERE "translators"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_translator
      @translator = Translator.find(params[:id])